<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;


class MainController extends Controller
{
    /*public $Arr = array([
        ['Депутати', 'Присутній',],
        ['Баланюк О.І.', 21],
        ['Бражнікова Т.О.', 17],
        ['Булгакова Г.В.', 16],
        ['Виговський В.П.', 20],
        ['Войтович Т.О.', 15],
        ['Дрьомін Ю.Б.', 11],
        ['Жадан С.М.', 19],
        ['Клавдієнко О.І.', 17],
        ['Колодзян Ю.Д.', 12],
        ['Корнійчук Д.В.', 15],
        ['Костюченко В.П.', 10],
        ['Кравченко М.М.', 10],
        ['Круковець В.В.', 16],
        ['Кулініч Л.М.', 12],
        ['Кучмій О.В.', 11],
        ['Лісогор В.Ю.', 15],
        ['Лісогор О.Я.', 18],
    ]);*/


    public function present()
    {
        $Arr1 = [
        ['Депутати', 'Присутній',],
        ['Баланюк О.І.', 21],
        ['Бражнікова Т.О.', 17],
        ['Булгакова Г.В.', 16],
        ['Виговський В.П.', 20],
        ['Войтович Т.О.', 15],
        ['Дрьомін Ю.Б.', 11],
        ['Жадан С.М.', 19],
        ['Клавдієнко О.І.', 17],
        ['Колодзян Ю.Д.', 12],
        ['Корнійчук Д.В.', 15],
        ['Костюченко В.П.', 10],
        ['Кравченко М.М.', 10],
        ['Круковець В.В.', 16],
        ['Кулініч Л.М.', 12],
        ['Кучмій О.В.', 11],
        ['Лісогор В.Ю.', 15],
        ['Лісогор О.Я.', 18],
    ];
        $string =json_encode($Arr1, JSON_UNESCAPED_UNICODE) ;
        $str = html_entity_decode( $string );
        return view('pages.stat-vidviduvannja')->with('Arr',$str);
            //->with('Arr',json_encode($Arr1, JSON_UNESCAPED_UNICODE|JSON_HEX_APOS|JSON_HEX_QUOT) );


    }
}
